In [1]:
import numpy as np

import pandas as pd

In [2]:
some_arr = np.arange(12)

some_arr.shape =(3,4)

In [3]:
some_arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [4]:
list_1 = [1,2,3,4,5,6]

In [5]:
list_1[5]

6

In [6]:
list_student_rollnos = [33,66,88,22,99]

series_student_rollnos = pd.Series(list_student_rollnos, index =['Rahul', 'Sarvesh', 'Naman','Ayush','Samar'])

In [8]:
series_student_rollnos['Sarvesh']

66

In [9]:
series_student_rollnos[2]

88

In [10]:
some_2d_array = np.random.randint(2,9,(5,5))

In [11]:
some_2d_array

array([[8, 7, 7, 6, 6],
       [8, 5, 3, 8, 2],
       [4, 5, 8, 8, 5],
       [3, 2, 2, 4, 3],
       [8, 4, 4, 2, 7]])

In [17]:
some_df = pd.DataFrame(some_2d_array, columns =['A','B','C','D','E'], index =['sub1','sub2','sub3','sub4','sub5'])

In [15]:
some_df['A']

0    8
1    8
2    4
3    3
4    8
Name: A, dtype: int32

In [23]:
some_df.loc['sub2',:]

A    8
B    5
C    3
D    8
E    2
Name: sub2, dtype: int32

In [25]:
some_df

      A  B  C  D  E
sub1  8  7  7  6  6
sub2  8  5  3  8  2
sub3  4  5  8  8  5
sub4  3  2  2  4  3
sub5  8  4  4  2  7

In [24]:
some_df.iloc[0,1]

7

In [26]:
list_of_lists = [[1,2,3],[4,5,6]]

list_of_lists

[[1, 2, 3], [4, 5, 6]]

In [28]:
pd.DataFrame(list_of_lists, index= ['a','b'], columns =['A','B','C'])

   A  B  C
a  1  2  3
b  4  5  6

In [39]:
std_dict = {'roll':[2,3,4,5,6], 'name':['arun','kumar','Sarvesh','Naman','rahul'], 'marks':[66,77,88,99,np.nan]}

In [40]:
std_dict

{'roll': [2, 3, 4, 5, 6],
 'name': ['arun', 'kumar', 'Sarvesh', 'Naman', 'rahul'],
 'marks': [66, 77, 88, 99, nan]}

In [41]:
std_df = pd.DataFrame(std_dict)

In [50]:
std_df.set_index('roll', inplace=True)

In [51]:
std_df

         name  marks
roll
2        arun   66.0
3       kumar   77.0
4     Sarvesh   88.0
5       Naman   99.0
6       rahul    NaN

In [52]:
std_df.loc[4,:]

name     Sarvesh
marks       88.0
Name: 4, dtype: object

In [2]:
import pandas as pd
#pd.read_csv("c:\\users\\user\\downloads\\titanic.csv")
titanic_df = pd.read_csv('titanic.csv')

In [3]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [7]:
titanic_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [5]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [8]:
titanic_df.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [9]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [10]:
titanic_df['Survived'].unique()

array([0, 1], dtype=int64)

In [11]:
titanic_df['Survived'].value_counts()

Survived
0    549
1    342
Name: count, dtype: int64

In [12]:
titanic_df['Sex'].value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [13]:
titanic_df[['Name','Survived']]

                                                  Name  Survived
0                              Braund, Mr. Owen Harris         0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...         1
2                               Heikkinen, Miss. Laina         1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)         1
4                             Allen, Mr. William Henry         0
..                                                 ...       ...
886                              Montvila, Rev. Juozas         0
887                       Graham, Miss. Margaret Edith         1
888           Johnston, Miss. Catherine Helen "Carrie"         0
889                              Behr, Mr. Karl Howell         1
890                                Dooley, Mr. Patrick         0

[891 rows x 2 columns]

In [16]:
titanic_df[titanic_df['Age']<10][['Name','Sex']]

                                         Name     Sex
7              Palsson, Master. Gosta Leonard    male
10            Sandstrom, Miss. Marguerite Rut  female
16                       Rice, Master. Eugene    male
24              Palsson, Miss. Torborg Danira  female
43   Laroche, Miss. Simonne Marie Anne Andree  female
..                                        ...     ...
827                     Mallet, Master. Andre    male
831           Richards, Master. George Sibley    male
850   Andersson, Master. Sigvard Harald Elias    male
852                   Boulos, Miss. Nourelain  female
869           Johnson, Master. Harold Theodor    male

[62 rows x 2 columns]

In [21]:
print("total no. of passengers who survived and are less than 10 years is :",titanic_df[(titanic_df['Age']<10) & (titanic_df['Survived']==1)].shape[0])

total no. of passengers who survived and are less than 10 years is : 38

In [23]:
titanic_df[((titanic_df['Age']<10) | (titanic_df['Age']>75)) & (titanic_df['Survived']==1)].shape

(39, 12)

In [25]:
grouped_data = titanic_df.groupby('Sex')

In [28]:
grouped_data.get_group('female')['Age'].mean()

27.915708812260537

In [33]:
titanic_df.groupby('Survived')['Fare'].sum()

Survived
0    12142.7199
1    16551.2294
Name: Fare, dtype: float64

In [35]:
titanic_df.groupby(['Sex','Survived'])['Age'].mean()

Sex     Survived
female  0           25.046875
        1           28.847716
male    0           31.618056
        1           27.276022
Name: Age, dtype: float64

In [36]:
titanic_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [37]:
titanic_df.groupby(['Pclass', 'Sex','Survived'])['Fare'].mean()

Pclass  Sex     Survived
1       female  0           110.604167
                1           105.978159
        male    0            62.894910
                1            74.637320
2       female  0            18.250000
                1            22.288989
        male    0            19.488965
                1            21.095100
3       female  0            19.773093
                1            12.464526
        male    0            12.204469
                1            15.579696
Name: Fare, dtype: float64

In [39]:
titanic_df.groupby(['Pclass', 'Sex','Survived'])['Age'].agg(['mean','min','max','sum'])

                             mean    min   max      sum
Pclass Sex    Survived
1      female 0         25.666667   2.00  50.0    77.00
              1         34.939024  14.00  63.0  2865.00
       male   0         44.581967  18.00  71.0  2719.50
              1         36.248000   0.92  80.0  1449.92
2      female 0         36.000000  24.00  57.0   216.00
              1         28.080882   2.00  55.0  1909.50
       male   0         33.369048  16.00  70.0  2803.00
              1         16.022000   0.67  62.0   240.33
3      female 0         23.818182   2.00  48.0  1310.00
              1         19.329787   0.75  63.0   908.50
       male   0         27.255814   1.00  74.0  5860.00
              1         22.274211   0.42  45.0   846.42

In [42]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Status
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Adult
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Adult
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Adult
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Adult
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Adult

In [46]:
titanic_df['Status'].value_counts()

Status
[Adult]    727
[Child]    164
Name: count, dtype: int64

In [41]:

titanic_df['Status'] ='dk'
for i in range(titanic_df.shape[0]):
    if titanic_df.loc[i,'Age']<20:
        titanic_df.loc[i,'Status'] = 'Child'
    else:
        titanic_df.loc[i,'Status'] = 'Adult'

In [45]:

titanic_df['Status'] ='dk'
for i in range(titanic_df.shape[0]):
    titanic_df.loc[i,'Status'] = ['Child' if titanic_df.loc[i,'Age']<20 else 'Adult']

In [47]:
def categorize_age(age):
    if age<20:
        return 'Child'
    else:
        return 'Adult'

In [48]:
titanic_df['Status'] = titanic_df['Age'].apply(categorize_age)

In [49]:
titanic_df['Status'] = titanic_df['Age'].apply(lambda x: 'Child' if x<20 else 'Adult')

In [50]:
titanic_df.loc[:,['Status','Age']]

    Status   Age
0    Adult  22.0
1    Adult  38.0
2    Adult  26.0
3    Adult  35.0
4    Adult  35.0
..     ...   ...
886  Adult  27.0
887  Child  19.0
888  Adult   NaN
889  Adult  26.0
890  Adult  32.0

[891 rows x 2 columns]

In [57]:
def surv_perct(series):
    return (series.sum()/series.count()*100)

In [58]:
titanic_df.groupby(['Sex','Pclass'])['Survived'].agg(surv_perct)

Sex     Pclass
female  1         96.808511
        2         92.105263
        3         50.000000
male    1         36.885246
        2         15.740741
        3         13.544669
Name: Survived, dtype: float64

In [9]:
titanic_df[((titanic_df['Age']<10) | (titanic_df['Age']>75)) & (titanic_df['Survived']==1)].to_csv('survived_children_old.csv')

In [11]:
titanic_df.sort_values('Age', ascending=False)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [13]:
titanic_df.sort_values(['Pclass','Age'], ascending=[True, False])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
745,746,0,1,"Crosby, Capt. Edward Gifford",male,70.0,1,1,WE/P 5735,71.0000,B22,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [15]:
titanic_df.pivot_table(index='Pclass', columns='Sex', values='Age', aggfunc='mean')

Sex        female       male
Pclass
1       34.611765  41.281386
2       28.722973  30.740707
3       21.750000  26.507589

In [16]:
titanic_df.pivot_table(index='Survived', columns='Sex', values='Age', aggfunc='mean')

Sex          female       male
Survived
0         25.046875  31.618056
1         28.847716  27.276022

In [17]:
titanic_df['Status'] = titanic_df['Age'].apply(lambda x: 'Child' if x<20 else 'Adult')

In [20]:
titanic_df.pivot_table(index='Survived', columns = 'Status', values = 'Fare', aggfunc='mean')

Status        Adult      Child
Survived
0         21.397870  26.048333
1         51.524715  37.977586

In [34]:
titanic_df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
Status         0
dtype: int64

In [25]:
titanic_df = titanic_df.drop(columns ='Cabin')

#titanic_df = titanic_df.drop('Cabin', axis =1)

In [26]:
titanic_df.dropna(subset=['Embarked'], inplace=True)

In [33]:
#titanic_df['Age'].fillna(0)
#titanic_df['Age'].fillna('na')

titanic_df['Age'].fillna(titanic_df['Age'].mean(), inplace=True)

In [32]:
titanic_df['Age'].fillna(method ='bfill')

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    26.0
889    26.0
890    32.0
Name: Age, Length: 889, dtype: float64

In [37]:
from datetime import date, datetime

date.today()

datetime.date(2024, 7, 11)

In [51]:
some_date ='2022-10-10'

#type(some_date)
some_date = datetime.strptime(some_date,'%Y-%m-%d')

In [41]:
type(some_date)

datetime.datetime

In [44]:
some_date.year

2022

In [46]:
some_date = datetime.strftime(some_date, '%d-%m-%y')

In [47]:
some_date

'10-10-22'

In [49]:
from datetime import timedelta

In [52]:
type(some_date)

datetime.datetime

In [53]:
some_date

datetime.datetime(2022, 10, 10, 0, 0)

In [54]:
some_date+ timedelta(days=22)

datetime.datetime(2022, 11, 1, 0, 0)

In [55]:
titanic_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Embarked', 'Status'],
      dtype='object')

In [56]:
titanic_df['Dob'] = titanic_df['Age'].apply(lambda x: date.today() - timedelta(days =x*365))

In [57]:
titanic_df.loc[:,['Dob','Age']]

            Dob        Age
0    2002-07-17  22.000000
1    1986-07-21  38.000000
2    1998-07-18  26.000000
3    1989-07-20  35.000000
4    1989-07-20  35.000000
..          ...        ...
886  1997-07-18  27.000000
887  2005-07-16  19.000000
888  1994-11-27  29.642093
889  1998-07-18  26.000000
890  1992-07-19  32.000000

[889 rows x 2 columns]

In [58]:
titanic_df.loc[1,'Dob']

datetime.date(1986, 7, 21)